una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7xc256.h
/* -------- AES_CR : (AES Offset: 0x0) Control Register -------- */
#define AT91C_AES_START       ((unsigned int) 0x1 <<  0) /* (AES) Starts Processing*/
#define AT91C_AES_SWRST       ((unsigned int) 0x1 <<  8) /* (AES) Software Reset*/
#define AT91C_AES_LOADSEED    ((unsigned int) 0x1 << 16) /* (AES) Random Number Generator Seed Loading*/
/* -------- AES_MR : (AES Offset: 0x4) Mode Register -------- */
#define AT91C_AES_CIPHER      ((unsigned int) 0x1 <<  0) /* (AES) Processing Mode*/
#define AT91C_AES_PROCDLY     ((unsigned int) 0xF <<  4) /* (AES) Processing Delay*/
#define AT91C_AES_SMOD        ((unsigned int) 0x3 <<  8) /* (AES) Start Mode*/
#define 	AT91C_AES_SMOD_MANUAL               ((unsigned int) 0x0 <<  8) /* (AES) Manual Mode: The START bit in register AES_CR must be set to begin encryption or decryption.*/
#define 	AT91C_AES_SMOD_AUTO                 ((unsigned int) 0x1 <<  8) /* (AES) Auto Mode: no action in AES_CR is necessary (cf datasheet).*/
#define 	AT91C_AES_SMOD_PDC                  ((unsigned int) 0x2 <<  8) /* (AES) PDC Mode (cf datasheet).*/
#define AT91C_AES_OPMOD       ((unsigned int) 0x7 << 12) /* (AES) Operation Mode*/
#define 	AT91C_AES_OPMOD_ECB                  ((unsigned int) 0x0 << 12) /* (AES) ECB Electronic CodeBook mode.*/
#define 	AT91C_AES_OPMOD_CBC                  ((unsigned int) 0x1 << 12) /* (AES) CBC Cipher Block Chaining mode.*/
#define 	AT91C_AES_OPMOD_OFB                  ((unsigned int) 0x2 << 12) /* (AES) OFB Output Feedback mode.*/
#define 	AT91C_AES_OPMOD_CFB                  ((unsigned int) 0x3 << 12) /* (AES) CFB Cipher Feedback mode.*/
#define 	AT91C_AES_OPMOD_CTR                  ((unsigned int) 0x4 << 12) /* (AES) CTR Counter mode.*/
#define AT91C_AES_LOD         ((unsigned int) 0x1 << 15) /* (AES) Last Output Data Mode*/
#define AT91C_AES_CFBS        ((unsigned int) 0x7 << 16) /* (AES) Cipher Feedback Data Size*/
#define 	AT91C_AES_CFBS_128_BIT              ((unsigned int) 0x0 << 16) /* (AES) 128-bit.*/
#define 	AT91C_AES_CFBS_64_BIT               ((unsigned int) 0x1 << 16) /* (AES) 64-bit.*/
#define 	AT91C_AES_CFBS_32_BIT               ((unsigned int) 0x2 << 16) /* (AES) 32-bit.*/
#define 	AT91C_AES_CFBS_16_BIT               ((unsigned int) 0x3 << 16) /* (AES) 16-bit.*/
#define 	AT91C_AES_CFBS_8_BIT                ((unsigned int) 0x4 << 16) /* (AES) 8-bit.*/
#define AT91C_AES_CKEY        ((unsigned int) 0xF << 20) /* (AES) Countermeasure Key*/
#define AT91C_AES_CTYPE       ((unsigned int) 0x1F << 24) /* (AES) Countermeasure Type*/
#define 	AT91C_AES_CTYPE_TYPE1_EN             ((unsigned int) 0x1 << 24) /* (AES) Countermeasure type 1 is enabled.*/
#define 	AT91C_AES_CTYPE_TYPE2_EN             ((unsigned int) 0x2 << 24) /* (AES) Countermeasure type 2 is enabled.*/
#define 	AT91C_AES_CTYPE_TYPE3_EN             ((unsigned int) 0x4 << 24) /* (AES) Countermeasure type 3 is enabled.*/
#define 	AT91C_AES_CTYPE_TYPE4_EN             ((unsigned int) 0x8 << 24) /* (AES) Countermeasure type 4 is enabled.*/
#define 	AT91C_AES_CTYPE_TYPE5_EN             ((unsigned int) 0x10 << 24) /* (AES) Countermeasure type 5 is enabled.*/
/* -------- AES_IER : (AES Offset: 0x10) Interrupt Enable Register -------- */
#define AT91C_AES_DATRDY      ((unsigned int) 0x1 <<  0) /* (AES) DATRDY*/
#define AT91C_AES_ENDRX       ((unsigned int) 0x1 <<  1) /* (AES) PDC Read Buffer End*/
#define AT91C_AES_ENDTX       ((unsigned int) 0x1 <<  2) /* (AES) PDC Write Buffer End*/
#define AT91C_AES_RXBUFF      ((unsigned int) 0x1 <<  3) /* (AES) PDC Read Buffer Full*/
#define AT91C_AES_TXBUFE      ((unsigned int) 0x1 <<  4) /* (AES) PDC Write Buffer Empty*/
#define AT91C_AES_URAD        ((unsigned int) 0x1 <<  8) /* (AES) Unspecified Register Access Detection*/
/* -------- AES_IDR : (AES Offset: 0x14) Interrupt Disable Register -------- */
/* -------- AES_IMR : (AES Offset: 0x18) Interrupt Mask Register -------- */
/* -------- AES_ISR : (AES Offset: 0x1c) Interrupt Status Register -------- */
#define AT91C_AES_URAT        ((unsigned int) 0x7 << 12) /* (AES) Unspecified Register Access Type Status*/
#define 	AT91C_AES_URAT_IN_DAT_WRITE_DATPROC ((unsigned int) 0x0 << 12) /* (AES) Input data register written during the data processing in PDC mode.*/
#define 	AT91C_AES_URAT_OUT_DAT_READ_DATPROC ((unsigned int) 0x1 << 12) /* (AES) Output data register read during the data processing.*/
#define 	AT91C_AES_URAT_MODEREG_WRITE_DATPROC ((unsigned int) 0x2 << 12) /* (AES) Mode register written during the data processing.*/
#define 	AT91C_AES_URAT_OUT_DAT_READ_SUBKEY  ((unsigned int) 0x3 << 12) /* (AES) Output data register read during the sub-keys generation.*/
#define 	AT91C_AES_URAT_MODEREG_WRITE_SUBKEY ((unsigned int) 0x4 << 12) /* (AES) Mode register written during the sub-keys generation.*/
#define 	AT91C_AES_URAT_WO_REG_READ          ((unsigned int) 0x5 << 12) /* (AES) Write-only register read access.*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Triple Data Encryption Standard*/
/* ******************************************************************************/
typedef struct _AT91S_TDES {
	AT91_REG	 TDES_CR; 	/* Control Register*/
	AT91_REG	 TDES_MR; 	/* Mode Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 TDES_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 TDES_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 TDES_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 TDES_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 TDES_KEY1WxR[2]; 	/* Key 1 Word x Register*/
	AT91_REG	 TDES_KEY2WxR[2]; 	/* Key 2 Word x Register*/
	AT91_REG	 TDES_KEY3WxR[2]; 	/* Key 3 Word x Register*/
	AT91_REG	 Reserved1[2]; 	/* */
	AT91_REG	 TDES_IDATAxR[2]; 	/* Input Data x Register*/
	AT91_REG	 Reserved2[2]; 	/* */
	AT91_REG	 TDES_ODATAxR[2]; 	/* Output Data x Register*/
	AT91_REG	 Reserved3[2]; 	/* */
	AT91_REG	 TDES_IVxR[2]; 	/* Initialization Vector x Register*/
	AT91_REG	 Reserved4[37]; 	/* */
	AT91_REG	 TDES_VR; 	/* TDES Version Register*/
	AT91_REG	 TDES_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 TDES_RCR; 	/* Receive Counter Register*/
	AT91_REG	 TDES_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 TDES_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 TDES_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 TDES_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 TDES_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 TDES_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 TDES_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 TDES_PTSR; 	/* PDC Transfer Status Register*/
} AT91S_TDES, *AT91PS_TDES;

/* -------- TDES_CR : (TDES Offset: 0x0) Control Register -------- */
#define AT91C_TDES_START      ((unsigned int) 0x1 <<  0) /* (TDES) Starts Processing*/
#define AT91C_TDES_SWRST      ((unsigned int) 0x1 <<  8) /* (TDES) Software Reset*/
/* -------- TDES_MR : (TDES Offset: 0x4) Mode Register -------- */
#define AT91C_TDES_CIPHER     ((unsigned int) 0x1 <<  0) /* (TDES) Processing Mode*/
#define AT91C_TDES_TDESMOD    ((unsigned int) 0x1 <<  1) /* (TDES) Single or Triple DES Mode*/
#define AT91C_TDES_KEYMOD     ((unsigned int) 0x1 <<  4) /* (TDES) Key Mode*/
#define AT91C_TDES_SMOD       ((unsigned int) 0x3 <<  8) /* (TDES) Start Mode*/
#define 	AT91C_TDES_SMOD_MANUAL               ((unsigned int) 0x0 <<  8) /* (TDES) Manual Mode: The START bit in register TDES_CR must be set to begin encryption or decryption.*/
#define 	AT91C_TDES_SMOD_AUTO                 ((unsigned int) 0x1 <<  8) /* (TDES) Auto Mode: no action in TDES_CR is necessary (cf datasheet).*/
#define 	AT91C_TDES_SMOD_PDC                  ((unsigned int) 0x2 <<  8) /* (TDES) PDC Mode (cf datasheet).*/
#define AT91C_TDES_OPMOD      ((unsigned int) 0x3 << 12) /* (TDES) Operation Mode*/
#define 	AT91C_TDES_OPMOD_ECB                  ((unsigned int) 0x0 << 12) /* (TDES) ECB Electronic CodeBook mode.*/
#define 	AT91C_TDES_OPMOD_CBC                  ((unsigned int) 0x1 << 12) /* (TDES) CBC Cipher Block Chaining mode.*/
#define 	AT91C_TDES_OPMOD_OFB                  ((unsigned int) 0x2 << 12) /* (TDES) OFB Output Feedback mode.*/
#define 	AT91C_TDES_OPMOD_CFB                  ((unsigned int) 0x3 << 12) /* (TDES) CFB Cipher Feedback mode.*/
#define AT91C_TDES_LOD        ((unsigned int) 0x1 << 15) /* (TDES) Last Output Data Mode*/
#define AT91C_TDES_CFBS       ((unsigned int) 0x3 << 16) /* (TDES) Cipher Feedback Data Size*/
#define 	AT91C_TDES_CFBS_64_BIT               ((unsigned int) 0x0 << 16) /* (TDES) 64-bit.*/
#define 	AT91C_TDES_CFBS_32_BIT               ((unsigned int) 0x1 << 16) /* (TDES) 32-bit.*/
#define 	AT91C_TDES_CFBS_16_BIT               ((unsigned int) 0x2 << 16) /* (TDES) 16-bit.*/
#define 	AT91C_TDES_CFBS_8_BIT                ((unsigned int) 0x3 << 16) /* (TDES) 8-bit.*/
/* -------- TDES_IER : (TDES Offset: 0x10) Interrupt Enable Register -------- */
#define AT91C_TDES_DATRDY     ((unsigned int) 0x1 <<  0) /* (TDES) DATRDY*/
#define AT91C_TDES_ENDRX      ((unsigned int) 0x1 <<  1) /* (TDES) PDC Read Buffer End*/
#define AT91C_TDES_ENDTX      ((unsigned int) 0x1 <<  2) /* (TDES) PDC Write Buffer End*/
#define AT91C_TDES_RXBUFF     ((unsigned int) 0x1 <<  3) /* (TDES) PDC Read Buffer Full*/
#define AT91C_TDES_TXBUFE     ((unsigned int) 0x1 <<  4) /* (TDES) PDC Write Buffer Empty*/
#define AT91C_TDES_URAD       ((unsigned int) 0x1 <<  8) /* (TDES) Unspecified Register Access Detection*/
/* -------- TDES_IDR : (TDES Offset: 0x14) Interrupt Disable Register -------- */
/* -------- TDES_IMR : (TDES Offset: 0x18) Interrupt Mask Register -------- */
/* -------- TDES_ISR : (TDES Offset: 0x1c) Interrupt Status Register -------- */
#define AT91C_TDES_URAT       ((unsigned int) 0x3 << 12) /* (TDES) Unspecified Register Access Type Status*/
#define 	AT91C_TDES_URAT_IN_DAT_WRITE_DATPROC ((unsigned int) 0x0 << 12) /* (TDES) Input data register written during the data processing in PDC mode.*/
#define 	AT91C_TDES_URAT_OUT_DAT_READ_DATPROC ((unsigned int) 0x1 << 12) /* (TDES) Output data register read during the data processing.*/
#define 	AT91C_TDES_URAT_MODEREG_WRITE_DATPROC ((unsigned int) 0x2 << 12) /* (TDES) Mode register written during the data processing.*/
#define 	AT91C_TDES_URAT_WO_REG_READ          ((unsigned int) 0x3 << 12) /* (TDES) Write-only register read access.*/

