una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7xc256.h
#define AT91C_AES_PTCR  ((AT91_REG *) 	0xFFFA4120) /* (PDC_AES) PDC Transfer Control Register*/
#define AT91C_AES_TNPR  ((AT91_REG *) 	0xFFFA4118) /* (PDC_AES) Transmit Next Pointer Register*/
#define AT91C_AES_RNPR  ((AT91_REG *) 	0xFFFA4110) /* (PDC_AES) Receive Next Pointer Register*/
#define AT91C_AES_TPR   ((AT91_REG *) 	0xFFFA4108) /* (PDC_AES) Transmit Pointer Register*/
#define AT91C_AES_RPR   ((AT91_REG *) 	0xFFFA4100) /* (PDC_AES) Receive Pointer Register*/
#define AT91C_AES_PTSR  ((AT91_REG *) 	0xFFFA4124) /* (PDC_AES) PDC Transfer Status Register*/
#define AT91C_AES_TNCR  ((AT91_REG *) 	0xFFFA411C) /* (PDC_AES) Transmit Next Counter Register*/
#define AT91C_AES_RNCR  ((AT91_REG *) 	0xFFFA4114) /* (PDC_AES) Receive Next Counter Register*/
#define AT91C_AES_TCR   ((AT91_REG *) 	0xFFFA410C) /* (PDC_AES) Transmit Counter Register*/
#define AT91C_AES_RCR   ((AT91_REG *) 	0xFFFA4104) /* (PDC_AES) Receive Counter Register*/
/* ========== Register definition for AES peripheral ========== */
#define AT91C_AES_IVxR  ((AT91_REG *) 	0xFFFA4060) /* (AES) Initialization Vector x Register*/
#define AT91C_AES_ODATAxR ((AT91_REG *) 	0xFFFA4050) /* (AES) Output Data x Register*/
#define AT91C_AES_IDATAxR ((AT91_REG *) 	0xFFFA4040) /* (AES) Input Data x Register*/
#define AT91C_AES_IER   ((AT91_REG *) 	0xFFFA4010) /* (AES) Interrupt Enable Register*/
#define AT91C_AES_CR    ((AT91_REG *) 	0xFFFA4000) /* (AES) Control Register*/
#define AT91C_AES_VR    ((AT91_REG *) 	0xFFFA40FC) /* (AES) AES Version Register*/
#define AT91C_AES_MR    ((AT91_REG *) 	0xFFFA4004) /* (AES) Mode Register*/
#define AT91C_AES_IDR   ((AT91_REG *) 	0xFFFA4014) /* (AES) Interrupt Disable Register*/
#define AT91C_AES_ISR   ((AT91_REG *) 	0xFFFA401C) /* (AES) Interrupt Status Register*/
#define AT91C_AES_IMR   ((AT91_REG *) 	0xFFFA4018) /* (AES) Interrupt Mask Register*/
#define AT91C_AES_KEYWxR ((AT91_REG *) 	0xFFFA4020) /* (AES) Key Word x Register*/
/* ========== Register definition for PDC_TDES peripheral ========== */
#define AT91C_TDES_PTSR ((AT91_REG *) 	0xFFFA8124) /* (PDC_TDES) PDC Transfer Status Register*/
#define AT91C_TDES_TNCR ((AT91_REG *) 	0xFFFA811C) /* (PDC_TDES) Transmit Next Counter Register*/
#define AT91C_TDES_RNCR ((AT91_REG *) 	0xFFFA8114) /* (PDC_TDES) Receive Next Counter Register*/
#define AT91C_TDES_TCR  ((AT91_REG *) 	0xFFFA810C) /* (PDC_TDES) Transmit Counter Register*/
#define AT91C_TDES_RCR  ((AT91_REG *) 	0xFFFA8104) /* (PDC_TDES) Receive Counter Register*/
#define AT91C_TDES_PTCR ((AT91_REG *) 	0xFFFA8120) /* (PDC_TDES) PDC Transfer Control Register*/
#define AT91C_TDES_TNPR ((AT91_REG *) 	0xFFFA8118) /* (PDC_TDES) Transmit Next Pointer Register*/
#define AT91C_TDES_RNPR ((AT91_REG *) 	0xFFFA8110) /* (PDC_TDES) Receive Next Pointer Register*/
#define AT91C_TDES_TPR  ((AT91_REG *) 	0xFFFA8108) /* (PDC_TDES) Transmit Pointer Register*/
#define AT91C_TDES_RPR  ((AT91_REG *) 	0xFFFA8100) /* (PDC_TDES) Receive Pointer Register*/
/* ========== Register definition for TDES peripheral ========== */
#define AT91C_TDES_VR   ((AT91_REG *) 	0xFFFA80FC) /* (TDES) TDES Version Register*/
#define AT91C_TDES_IVxR ((AT91_REG *) 	0xFFFA8060) /* (TDES) Initialization Vector x Register*/
#define AT91C_TDES_ODATAxR ((AT91_REG *) 	0xFFFA8050) /* (TDES) Output Data x Register*/
#define AT91C_TDES_KEY1WxR ((AT91_REG *) 	0xFFFA8020) /* (TDES) Key 1 Word x Register*/
#define AT91C_TDES_IMR  ((AT91_REG *) 	0xFFFA8018) /* (TDES) Interrupt Mask Register*/
#define AT91C_TDES_IER  ((AT91_REG *) 	0xFFFA8010) /* (TDES) Interrupt Enable Register*/
#define AT91C_TDES_CR   ((AT91_REG *) 	0xFFFA8000) /* (TDES) Control Register*/
#define AT91C_TDES_ISR  ((AT91_REG *) 	0xFFFA801C) /* (TDES) Interrupt Status Register*/
#define AT91C_TDES_IDR  ((AT91_REG *) 	0xFFFA8014) /* (TDES) Interrupt Disable Register*/
#define AT91C_TDES_IDATAxR ((AT91_REG *) 	0xFFFA8040) /* (TDES) Input Data x Register*/
#define AT91C_TDES_KEY2WxR ((AT91_REG *) 	0xFFFA8028) /* (TDES) Key 2 Word x Register*/
#define AT91C_TDES_KEY3WxR ((AT91_REG *) 	0xFFFA8030) /* (TDES) Key 3 Word x Register*/
#define AT91C_TDES_MR   ((AT91_REG *) 	0xFFFA8004) /* (TDES) Mode Register*/

/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91SAM7XC256*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_RXD0     ((unsigned int) AT91C_PIO_PA0) /*  USART 0 Receive Data*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_TXD0     ((unsigned int) AT91C_PIO_PA1) /*  USART 0 Transmit Data*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_TWD      ((unsigned int) AT91C_PIO_PA10) /*  TWI Two-wire Serial Data*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_TWCK     ((unsigned int) AT91C_PIO_PA11) /*  TWI Two-wire Serial Clock*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_SPI0_NPCS0 ((unsigned int) AT91C_PIO_PA12) /*  SPI 0 Peripheral Chip Select 0*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA13) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PA13_PCK1     ((unsigned int) AT91C_PIO_PA13) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA14) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PA14_IRQ1     ((unsigned int) AT91C_PIO_PA14) /*  External Interrupt 1*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA15) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PA15_TCLK2    ((unsigned int) AT91C_PIO_PA15) /*  Timer Counter 2 external clock input*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_SPI0_MISO ((unsigned int) AT91C_PIO_PA16) /*  SPI 0 Master In Slave*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_SPI0_MOSI ((unsigned int) AT91C_PIO_PA17) /*  SPI 0 Master Out Slave*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_SPI0_SPCK ((unsigned int) AT91C_PIO_PA18) /*  SPI 0 Serial Clock*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_CANRX    ((unsigned int) AT91C_PIO_PA19) /*  CAN Receive*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_SCK0     ((unsigned int) AT91C_PIO_PA2) /*  USART 0 Serial Clock*/
#define AT91C_PA2_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA2) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_CANTX    ((unsigned int) AT91C_PIO_PA20) /*  CAN Transmit*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_TF       ((unsigned int) AT91C_PIO_PA21) /*  SSC Transmit Frame Sync*/
#define AT91C_PA21_SPI1_NPCS0 ((unsigned int) AT91C_PIO_PA21) /*  SPI 1 Peripheral Chip Select 0*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_TK       ((unsigned int) AT91C_PIO_PA22) /*  SSC Transmit Clock*/
#define AT91C_PA22_SPI1_SPCK ((unsigned int) AT91C_PIO_PA22) /*  SPI 1 Serial Clock*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_TD       ((unsigned int) AT91C_PIO_PA23) /*  SSC Transmit data*/
#define AT91C_PA23_SPI1_MOSI ((unsigned int) AT91C_PIO_PA23) /*  SPI 1 Master Out Slave*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_RD       ((unsigned int) AT91C_PIO_PA24) /*  SSC Receive Data*/
#define AT91C_PA24_SPI1_MISO ((unsigned int) AT91C_PIO_PA24) /*  SPI 1 Master In Slave*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_RK       ((unsigned int) AT91C_PIO_PA25) /*  SSC Receive Clock*/
#define AT91C_PA25_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PA25) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_RF       ((unsigned int) AT91C_PIO_PA26) /*  SSC Receive Frame Sync*/
#define AT91C_PA26_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA26) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_DRXD     ((unsigned int) AT91C_PIO_PA27) /*  DBGU Debug Receive Data*/
#define AT91C_PA27_PCK3     ((unsigned int) AT91C_PIO_PA27) /*  PMC Programmable Clock Output 3*/
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_DTXD     ((unsigned int) AT91C_PIO_PA28) /*  DBGU Debug Transmit Data*/
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_FIQ      ((unsigned int) AT91C_PIO_PA29) /*  AIC Fast Interrupt Input*/
#define AT91C_PA29_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA29) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_RTS0     ((unsigned int) AT91C_PIO_PA3) /*  USART 0 Ready To Send*/
#define AT91C_PA3_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PA3) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_IRQ0     ((unsigned int) AT91C_PIO_PA30) /*  External Interrupt 0*/
#define AT91C_PA30_PCK2     ((unsigned int) AT91C_PIO_PA30) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_CTS0     ((unsigned int) AT91C_PIO_PA4) /*  USART 0 Clear To Send*/
#define AT91C_PA4_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PA4) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_RXD1     ((unsigned int) AT91C_PIO_PA5) /*  USART 1 Receive Data*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_TXD1     ((unsigned int) AT91C_PIO_PA6) /*  USART 1 Transmit Data*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_SCK1     ((unsigned int) AT91C_PIO_PA7) /*  USART 1 Serial Clock*/
#define AT91C_PA7_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PA7) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_RTS1     ((unsigned int) AT91C_PIO_PA8) /*  USART 1 Ready To Send*/
#define AT91C_PA8_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PA8) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_CTS1     ((unsigned int) AT91C_PIO_PA9) /*  USART 1 Clear To Send*/
#define AT91C_PA9_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PA9) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_ETXCK_EREFCK ((unsigned int) AT91C_PIO_PB0) /*  Ethernet MAC Transmit Clock/Reference Clock*/
#define AT91C_PB0_PCK0     ((unsigned int) AT91C_PIO_PB0) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_ETXEN    ((unsigned int) AT91C_PIO_PB1) /*  Ethernet MAC Transmit Enable*/
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_ETX2     ((unsigned int) AT91C_PIO_PB10) /*  Ethernet MAC Transmit Data 2*/
#define AT91C_PB10_SPI1_NPCS1 ((unsigned int) AT91C_PIO_PB10) /*  SPI 1 Peripheral Chip Select 1*/
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_ETX3     ((unsigned int) AT91C_PIO_PB11) /*  Ethernet MAC Transmit Data 3*/
#define AT91C_PB11_SPI1_NPCS2 ((unsigned int) AT91C_PIO_PB11) /*  SPI 1 Peripheral Chip Select 2*/
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_ETXER    ((unsigned int) AT91C_PIO_PB12) /*  Ethernet MAC Transmikt Coding Error*/
#define AT91C_PB12_TCLK0    ((unsigned int) AT91C_PIO_PB12) /*  Timer Counter 0 external clock input*/
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_ERX2     ((unsigned int) AT91C_PIO_PB13) /*  Ethernet MAC Receive Data 2*/
#define AT91C_PB13_SPI0_NPCS1 ((unsigned int) AT91C_PIO_PB13) /*  SPI 0 Peripheral Chip Select 1*/
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_ERX3     ((unsigned int) AT91C_PIO_PB14) /*  Ethernet MAC Receive Data 3*/
#define AT91C_PB14_SPI0_NPCS2 ((unsigned int) AT91C_PIO_PB14) /*  SPI 0 Peripheral Chip Select 2*/
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_ERXDV_ECRSDV ((unsigned int) AT91C_PIO_PB15) /*  Ethernet MAC Receive Data Valid*/
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_ECOL     ((unsigned int) AT91C_PIO_PB16) /*  Ethernet MAC Collision Detected*/
#define AT91C_PB16_SPI1_NPCS3 ((unsigned int) AT91C_PIO_PB16) /*  SPI 1 Peripheral Chip Select 3*/
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_ERXCK    ((unsigned int) AT91C_PIO_PB17) /*  Ethernet MAC Receive Clock*/
#define AT91C_PB17_SPI0_NPCS3 ((unsigned int) AT91C_PIO_PB17) /*  SPI 0 Peripheral Chip Select 3*/
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_EF100    ((unsigned int) AT91C_PIO_PB18) /*  Ethernet MAC Force 100 Mbits/sec*/
#define AT91C_PB18_ADTRG    ((unsigned int) AT91C_PIO_PB18) /*  ADC External Trigger*/
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_PWM0     ((unsigned int) AT91C_PIO_PB19) /*  PWM Channel 0*/
#define AT91C_PB19_TCLK1    ((unsigned int) AT91C_PIO_PB19) /*  Timer Counter 1 external clock input*/
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_ETX0     ((unsigned int) AT91C_PIO_PB2) /*  Ethernet MAC Transmit Data 0*/
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_PWM1     ((unsigned int) AT91C_PIO_PB20) /*  PWM Channel 1*/
#define AT91C_PB20_PCK0     ((unsigned int) AT91C_PIO_PB20) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_PWM2     ((unsigned int) AT91C_PIO_PB21) /*  PWM Channel 2*/
#define AT91C_PB21_PCK1     ((unsigned int) AT91C_PIO_PB21) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_PWM3     ((unsigned int) AT91C_PIO_PB22) /*  PWM Channel 3*/
#define AT91C_PB22_PCK2     ((unsigned int) AT91C_PIO_PB22) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_TIOA0    ((unsigned int) AT91C_PIO_PB23) /*  Timer Counter 0 Multipurpose Timer I/O Pin A*/
#define AT91C_PB23_DCD1     ((unsigned int) AT91C_PIO_PB23) /*  USART 1 Data Carrier Detect*/
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_TIOB0    ((unsigned int) AT91C_PIO_PB24) /*  Timer Counter 0 Multipurpose Timer I/O Pin B*/
#define AT91C_PB24_DSR1     ((unsigned int) AT91C_PIO_PB24) /*  USART 1 Data Set ready*/
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_TIOA1    ((unsigned int) AT91C_PIO_PB25) /*  Timer Counter 1 Multipurpose Timer I/O Pin A*/
#define AT91C_PB25_DTR1     ((unsigned int) AT91C_PIO_PB25) /*  USART 1 Data Terminal ready*/
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_TIOB1    ((unsigned int) AT91C_PIO_PB26) /*  Timer Counter 1 Multipurpose Timer I/O Pin B*/
#define AT91C_PB26_RI1      ((unsigned int) AT91C_PIO_PB26) /*  USART 1 Ring Indicator*/
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_TIOA2    ((unsigned int) AT91C_PIO_PB27) /*  Timer Counter 2 Multipurpose Timer I/O Pin A*/
#define AT91C_PB27_PWM0     ((unsigned int) AT91C_PIO_PB27) /*  PWM Channel 0*/
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_TIOB2    ((unsigned int) AT91C_PIO_PB28) /*  Timer Counter 2 Multipurpose Timer I/O Pin B*/
#define AT91C_PB28_PWM1     ((unsigned int) AT91C_PIO_PB28) /*  PWM Channel 1*/
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_PCK1     ((unsigned int) AT91C_PIO_PB29) /*  PMC Programmable Clock Output 1*/
#define AT91C_PB29_PWM2     ((unsigned int) AT91C_PIO_PB29) /*  PWM Channel 2*/
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_ETX1     ((unsigned int) AT91C_PIO_PB3) /*  Ethernet MAC Transmit Data 1*/
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PB30_PCK2     ((unsigned int) AT91C_PIO_PB30) /*  PMC Programmable Clock Output 2*/
#define AT91C_PB30_PWM3     ((unsigned int) AT91C_PIO_PB30) /*  PWM Channel 3*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_ECRS     ((unsigned int) AT91C_PIO_PB4) /*  Ethernet MAC Carrier Sense/Carrier Sense and Data Valid*/
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_ERX0     ((unsigned int) AT91C_PIO_PB5) /*  Ethernet MAC Receive Data 0*/
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_ERX1     ((unsigned int) AT91C_PIO_PB6) /*  Ethernet MAC Receive Data 1*/
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_ERXER    ((unsigned int) AT91C_PIO_PB7) /*  Ethernet MAC Receive Error*/
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_EMDC     ((unsigned int) AT91C_PIO_PB8) /*  Ethernet MAC Management Data Clock*/
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_EMDIO    ((unsigned int) AT91C_PIO_PB9) /*  Ethernet MAC Management Data Input/Output*/

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91SAM7XC256*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A*/
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_SPI0   ((unsigned int)  4) /* Serial Peripheral Interface 0*/
#define AT91C_ID_SPI1   ((unsigned int)  5) /* Serial Peripheral Interface 1*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_SSC    ((unsigned int)  8) /* Serial Synchronous Controller*/
#define AT91C_ID_TWI    ((unsigned int)  9) /* Two-Wire Interface*/
#define AT91C_ID_PWMC   ((unsigned int) 10) /* PWM Controller*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TC0    ((unsigned int) 12) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 13) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 14) /* Timer Counter 2*/
#define AT91C_ID_CAN    ((unsigned int) 15) /* Control Area Network Controller*/
#define AT91C_ID_EMAC   ((unsigned int) 16) /* Ethernet MAC*/
#define AT91C_ID_ADC    ((unsigned int) 17) /* Analog-to-Digital Converter*/
#define AT91C_ID_AES    ((unsigned int) 18) /* Advanced Encryption Standard 128-bit*/
#define AT91C_ID_TDES   ((unsigned int) 19) /* Triple Data Encryption Standard*/
#define AT91C_ID_20_Reserved ((unsigned int) 20) /* Reserved*/
#define AT91C_ID_21_Reserved ((unsigned int) 21) /* Reserved*/
#define AT91C_ID_22_Reserved ((unsigned int) 22) /* Reserved*/
#define AT91C_ID_23_Reserved ((unsigned int) 23) /* Reserved*/
#define AT91C_ID_24_Reserved ((unsigned int) 24) /* Reserved*/
#define AT91C_ID_25_Reserved ((unsigned int) 25) /* Reserved*/
#define AT91C_ID_26_Reserved ((unsigned int) 26) /* Reserved*/
#define AT91C_ID_27_Reserved ((unsigned int) 27) /* Reserved*/
#define AT91C_ID_28_Reserved ((unsigned int) 28) /* Reserved*/
#define AT91C_ID_29_Reserved ((unsigned int) 29) /* Reserved*/
#define AT91C_ID_IRQ0   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ALL_INT   ((unsigned int) 0xC00FFFFF) /* ALL VALID INTERRUPTS*/

