una1veritas/Workspace/ARM/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7xc256.h
/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91SAM7XC256*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) /* (RSTC) Base Address*/
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) /* (RTTC) Base Address*/
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) /* (PITC) Base Address*/
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) /* (WDTC) Base Address*/
#define AT91C_BASE_VREG      ((AT91PS_VREG) 	0xFFFFFD60) /* (VREG) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFE4100) /* (PDC_SPI1) Base Address*/
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFE4000) /* (SPI1) Base Address*/
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI0) Base Address*/
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFE0000) /* (SPI0) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_PDC_SSC   ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC) Base Address*/
#define AT91C_BASE_SSC       ((AT91PS_SSC) 	0xFFFD4000) /* (SSC) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) /* (PWMC_CH3) Base Address*/
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) /* (PWMC_CH2) Base Address*/
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) /* (PWMC_CH1) Base Address*/
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) /* (PWMC_CH0) Base Address*/
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) /* (PWMC) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) /* (UDP) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TCB       ((AT91PS_TCB) 	0xFFFA0000) /* (TCB) Base Address*/
#define AT91C_BASE_CAN_MB0   ((AT91PS_CAN_MB) 	0xFFFD0200) /* (CAN_MB0) Base Address*/
#define AT91C_BASE_CAN_MB1   ((AT91PS_CAN_MB) 	0xFFFD0220) /* (CAN_MB1) Base Address*/
#define AT91C_BASE_CAN_MB2   ((AT91PS_CAN_MB) 	0xFFFD0240) /* (CAN_MB2) Base Address*/
#define AT91C_BASE_CAN_MB3   ((AT91PS_CAN_MB) 	0xFFFD0260) /* (CAN_MB3) Base Address*/
#define AT91C_BASE_CAN_MB4   ((AT91PS_CAN_MB) 	0xFFFD0280) /* (CAN_MB4) Base Address*/
#define AT91C_BASE_CAN_MB5   ((AT91PS_CAN_MB) 	0xFFFD02A0) /* (CAN_MB5) Base Address*/
#define AT91C_BASE_CAN_MB6   ((AT91PS_CAN_MB) 	0xFFFD02C0) /* (CAN_MB6) Base Address*/
#define AT91C_BASE_CAN_MB7   ((AT91PS_CAN_MB) 	0xFFFD02E0) /* (CAN_MB7) Base Address*/
#define AT91C_BASE_CAN       ((AT91PS_CAN) 	0xFFFD0000) /* (CAN) Base Address*/
#define AT91C_BASE_EMAC      ((AT91PS_EMAC) 	0xFFFDC000) /* (EMAC) Base Address*/
#define AT91C_BASE_PDC_ADC   ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_ADC) Base Address*/
#define AT91C_BASE_ADC       ((AT91PS_ADC) 	0xFFFD8000) /* (ADC) Base Address*/
#define AT91C_BASE_PDC_AES   ((AT91PS_PDC) 	0xFFFA4100) /* (PDC_AES) Base Address*/
#define AT91C_BASE_AES       ((AT91PS_AES) 	0xFFFA4000) /* (AES) Base Address*/
#define AT91C_BASE_PDC_TDES  ((AT91PS_PDC) 	0xFFFA8100) /* (PDC_TDES) Base Address*/
#define AT91C_BASE_TDES      ((AT91PS_TDES) 	0xFFFA8000) /* (TDES) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91SAM7XC256*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00010000) /* Internal SRAM size in byte (64 Kbytes)*/
/* IFLASH*/
#define AT91C_IFLASH	 ((char *) 	0x00100000) /* Internal FLASH base address*/
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00040000) /* Internal FLASH size in byte (256 Kbytes)*/
#define AT91C_IFLASH_PAGE_SIZE	 ((unsigned int) 256) /* Internal FLASH Page Size: 256 bytes*/
#define AT91C_IFLASH_LOCK_REGION_SIZE	 ((unsigned int) 16384) /* Internal FLASH Lock Region Size: 16 Kbytes*/
#define AT91C_IFLASH_NB_OF_PAGES	 ((unsigned int) 1024) /* Internal FLASH Number of Pages: 1024 bytes*/
#define AT91C_IFLASH_NB_OF_LOCK_BITS	 ((unsigned int) 16) /* Internal FLASH Number of Lock Bits: 16 bytes*/
#endif /* __IAR_SYSTEMS_ICC__ */

#ifdef __IAR_SYSTEMS_ASM__

/* - Hardware register definition*/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Advanced Interrupt Controller*/
/* - ******************************************************************************/
/* - -------- AIC_SMR : (AIC Offset: 0x0) Control Register -------- */
AT91C_AIC_PRIOR           EQU (0x7 <<  0) ;- (AIC) Priority Level
AT91C_AIC_PRIOR_LOWEST    EQU (0x0) ;- (AIC) Lowest priority level
AT91C_AIC_PRIOR_HIGHEST   EQU (0x7) ;- (AIC) Highest priority level
AT91C_AIC_SRCTYPE         EQU (0x3 <<  5) ;- (AIC) Interrupt Source Type
AT91C_AIC_SRCTYPE_EXT_LOW_LEVEL EQU (0x0 <<  5) ;- (AIC) External Sources Code Label Low-level Sensitive
AT91C_AIC_SRCTYPE_INT_HIGH_LEVEL EQU (0x0 <<  5) ;- (AIC) Internal Sources Code Label High-level Sensitive
AT91C_AIC_SRCTYPE_INT_POSITIVE_EDGE EQU (0x1 <<  5) ;- (AIC) Internal Sources Code Label Positive Edge triggered
AT91C_AIC_SRCTYPE_EXT_NEGATIVE_EDGE EQU (0x1 <<  5) ;- (AIC) External Sources Code Label Negative Edge triggered
AT91C_AIC_SRCTYPE_HIGH_LEVEL EQU (0x2 <<  5) ;- (AIC) Internal Or External Sources Code Label High-level Sensitive
AT91C_AIC_SRCTYPE_POSITIVE_EDGE EQU (0x3 <<  5) ;- (AIC) Internal Or External Sources Code Label Positive Edge triggered
/* - -------- AIC_CISR : (AIC Offset: 0x114) AIC Core Interrupt Status Register -------- */
AT91C_AIC_NFIQ            EQU (0x1 <<  0) ;- (AIC) NFIQ Status
AT91C_AIC_NIRQ            EQU (0x1 <<  1) ;- (AIC) NIRQ Status
/* - -------- AIC_DCR : (AIC Offset: 0x138) AIC Debug Control Register (Protect) -------- */
AT91C_AIC_DCR_PROT        EQU (0x1 <<  0) ;- (AIC) Protection Mode
AT91C_AIC_DCR_GMSK        EQU (0x1 <<  1) ;- (AIC) General Mask

